bvladalex/tm4c123/spi_drivers_non_int/drivers/inc/TM4C123GH6PM_mcu1.h
typedef struct {                                    /*!< UDMA Structure                                                        */
  __IO uint32_t  STAT;                              /*!< DMA Status                                                            */
  __O  uint32_t  CFG;                               /*!< DMA Configuration                                                     */
  __IO uint32_t  CTLBASE;                           /*!< DMA Channel Control Base Pointer                                      */
  __IO uint32_t  ALTBASE;                           /*!< DMA Alternate Channel Control Base Pointer                            */
  __IO uint32_t  WAITSTAT;                          /*!< DMA Channel Wait-on-Request Status                                    */
  __O  uint32_t  SWREQ;                             /*!< DMA Channel Software Request                                          */
  __IO uint32_t  USEBURSTSET;                       /*!< DMA Channel Useburst Set                                              */
  __O  uint32_t  USEBURSTCLR;                       /*!< DMA Channel Useburst Clear                                            */
  __IO uint32_t  REQMASKSET;                        /*!< DMA Channel Request Mask Set                                          */
  __O  uint32_t  REQMASKCLR;                        /*!< DMA Channel Request Mask Clear                                        */
  __IO uint32_t  ENASET;                            /*!< DMA Channel Enable Set                                                */
  __O  uint32_t  ENACLR;                            /*!< DMA Channel Enable Clear                                              */
  __IO uint32_t  ALTSET;                            /*!< DMA Channel Primary Alternate Set                                     */
  __O  uint32_t  ALTCLR;                            /*!< DMA Channel Primary Alternate Clear                                   */
  __IO uint32_t  PRIOSET;                           /*!< DMA Channel Priority Set                                              */
  __O  uint32_t  PRIOCLR;                           /*!< DMA Channel Priority Clear                                            */
  __I  uint32_t  RESERVED0[3];
  __IO uint32_t  ERRCLR;                            /*!< DMA Bus Error Clear                                                   */
  __I  uint32_t  RESERVED1[300];
  __IO uint32_t  CHASGN;                            /*!< DMA Channel Assignment                                                */
  __IO uint32_t  CHIS;                              /*!< DMA Channel Interrupt Status                                          */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  CHMAP0;                            /*!< DMA Channel Map Select 0                                              */
  __IO uint32_t  CHMAP1;                            /*!< DMA Channel Map Select 1                                              */
  __IO uint32_t  CHMAP2;                            /*!< DMA Channel Map Select 2                                              */
  __IO uint32_t  CHMAP3;                            /*!< DMA Channel Map Select 3                                              */
} UDMA_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  /* anonymous unions are enabled by default */
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif

/*Clock enable/disable for peripherals macros*/

#define GPIOA_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<0) )
#define GPIOB_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<1) )
#define GPIOC_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<2) )
#define GPIOD_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<3) )
#define GPIOE_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<4) )
#define GPIOF_PCLK_EN()  (SYSCTL->RCGCGPIO |= (1U<<5) )

#define GPIOA_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<0) )
#define GPIOB_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<1) )
#define GPIOC_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<2) )
#define GPIOD_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<3) )
#define GPIOE_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<4) )
#define GPIOF_PCLK_DIS()  (SYSCTL->RCGCGPIO &= ~(1U<<5) )


////Clock gating for SPI peripherals/////////////////

#define SPI0_PCLK_EN()  (SYSCTL->RCGCSSI |= (1U<<0) )
#define SPI1_PCLK_EN()  (SYSCTL->RCGCSSI |= (1U<<1) )
#define SPI2_PCLK_EN()  (SYSCTL->RCGCSSI |= (1U<<2) )
#define SPI3_PCLK_EN()  (SYSCTL->RCGCSSI |= (1U<<3) )

#define SPI0_PCLK_DIS()  (SYSCTL->RCGCSSI &= ~(1U<<0) )
#define SPI1_PCLK_DIS()  (SYSCTL->RCGCSSI &= ~(1U<<1) )
#define SPI2_PCLK_DIS()  (SYSCTL->RCGCSSI &= ~(1U<<2) )
#define SPI3_PCLK_DIS()  (SYSCTL->RCGCSSI &= ~(1U<<3) )

///////Macros to disbale/reset GPIO peri

#define GPIOA_REG_RESET() GPIOA_PCLK_DIS()
#define GPIOB_REG_RESET() GPIOB_PCLK_DIS()
#define GPIOC_REG_RESET() GPIOC_PCLK_DIS()
#define GPIOD_REG_RESET() GPIOD_PCLK_DIS()
#define GPIOE_REG_RESET() GPIOE_PCLK_DIS()
#define GPIOF_REG_RESET() GPIOF_PCLK_DIS()

/*General defines*/

#define 	ENABLE 							1
#define 	DISABLE 						0
#define 	SET 								ENABLE
#define 	RESET 							DISABLE
#define 	GPIO_PIN_SET 				SET
#define 	GPIO_PIN_RESET 			RESET
#define 	FLAG_SET 						SET
#define 	FLAG_RESET 				  RESET



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define WATCHDOG0_BASE                  0x40000000UL
#define WATCHDOG1_BASE                  0x40001000UL
#define GPIOA_BASE                      0x40004000UL
#define GPIOB_BASE                      0x40005000UL
#define GPIOC_BASE                      0x40006000UL
#define GPIOD_BASE                      0x40007000UL
#define SSI0_BASE                       0x40008000UL
#define SSI1_BASE                       0x40009000UL
#define SSI2_BASE                       0x4000A000UL
#define SSI3_BASE                       0x4000B000UL
#define UART0_BASE                      0x4000C000UL
#define UART1_BASE                      0x4000D000UL
#define UART2_BASE                      0x4000E000UL
#define UART3_BASE                      0x4000F000UL
#define UART4_BASE                      0x40010000UL
#define UART5_BASE                      0x40011000UL
#define UART6_BASE                      0x40012000UL
#define UART7_BASE                      0x40013000UL
#define I2C0_BASE                       0x40020000UL
#define I2C1_BASE                       0x40021000UL
#define I2C2_BASE                       0x40022000UL
#define I2C3_BASE                       0x40023000UL
#define GPIOE_BASE                      0x40024000UL
#define GPIOF_BASE                      0x40025000UL
#define PWM0_BASE                       0x40028000UL
#define PWM1_BASE                       0x40029000UL
#define QEI0_BASE                       0x4002C000UL
#define QEI1_BASE                       0x4002D000UL
#define TIMER0_BASE                     0x40030000UL
#define TIMER1_BASE                     0x40031000UL
#define TIMER2_BASE                     0x40032000UL
#define TIMER3_BASE                     0x40033000UL
#define TIMER4_BASE                     0x40034000UL
#define TIMER5_BASE                     0x40035000UL
#define WTIMER0_BASE                    0x40036000UL
#define WTIMER1_BASE                    0x40037000UL
#define ADC0_BASE                       0x40038000UL
#define ADC1_BASE                       0x40039000UL
#define COMP_BASE                       0x4003C000UL
#define CAN0_BASE                       0x40040000UL
#define CAN1_BASE                       0x40041000UL
#define WTIMER2_BASE                    0x4004C000UL
#define WTIMER3_BASE                    0x4004D000UL
#define WTIMER4_BASE                    0x4004E000UL
#define WTIMER5_BASE                    0x4004F000UL
#define USB0_BASE                       0x40050000UL
#define GPIOA_AHB_BASE                  0x40058000UL
#define GPIOB_AHB_BASE                  0x40059000UL
#define GPIOC_AHB_BASE                  0x4005A000UL
#define GPIOD_AHB_BASE                  0x4005B000UL
#define GPIOE_AHB_BASE                  0x4005C000UL
#define GPIOF_AHB_BASE                  0x4005D000UL
#define EEPROM_BASE                     0x400AF000UL
#define SYSEXC_BASE                     0x400F9000UL
#define HIB_BASE                        0x400FC000UL
#define FLASH_CTRL_BASE                 0x400FD000UL
#define SYSCTL_BASE                     0x400FE000UL
#define UDMA_BASE                       0x400FF000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

